results/task#5/wrk_get.txt
wrk -t4 -c200 -d30s -sget.lua -R2000 --latency http://localhost:8080
Running 30s test @ http://localhost:8080
  4 threads and 200 connections
  Thread calibration: mean lat.: 1.949ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.937ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.866ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.870ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.67ms    1.50ms  23.84ms   93.51%
    Req/Sec   526.77    163.89     1.33k    73.26%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.37ms
 75.000%    1.87ms
 90.000%    2.57ms
 99.000%    8.85ms
 99.900%   15.69ms
 99.990%   20.11ms
 99.999%   23.85ms
100.000%   23.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.161     0.000000            1         1.00
       0.634     0.100000         3951         1.11
       0.840     0.200000         7913         1.25
       1.024     0.300000        11858         1.43
       1.199     0.400000        15798         1.67
       1.367     0.500000        19758         2.00
       1.452     0.550000        21728         2.22
       1.541     0.600000        23700         2.50
       1.634     0.650000        25665         2.86
       1.745     0.700000        27645         3.33
       1.866     0.750000        29619         4.00
       1.937     0.775000        30605         4.44
       2.018     0.800000        31592         5.00
       2.109     0.825000        32577         5.71
       2.229     0.850000        33566         6.67
       2.373     0.875000        34561         8.00
       2.457     0.887500        35044         8.89
       2.565     0.900000        35534        10.00
       2.707     0.912500        36033        11.43
       2.927     0.925000        36521        13.33
       3.235     0.937500        37015        16.00
       3.427     0.943750        37260        17.78
       3.729     0.950000        37506        20.00
       4.063     0.956250        37754        22.86
       4.539     0.962500        38000        26.67
       5.135     0.968750        38247        32.00
       5.479     0.971875        38371        35.56
       5.795     0.975000        38493        40.00
       6.331     0.978125        38617        45.71
       6.743     0.981250        38740        53.33
       7.387     0.984375        38865        64.00
       7.771     0.985938        38925        71.11
       8.159     0.987500        38987        80.00
       8.599     0.989062        39050        91.43
       9.151     0.990625        39110       106.67
       9.743     0.992188        39172       128.00
       9.959     0.992969        39203       142.22
      10.303     0.993750        39234       160.00
      10.679     0.994531        39265       182.86
      11.175     0.995313        39296       213.33
      11.631     0.996094        39327       256.00
      11.855     0.996484        39342       284.44
      12.191     0.996875        39358       320.00
      12.551     0.997266        39373       365.71
      13.175     0.997656        39388       426.67
      13.687     0.998047        39403       512.00
      13.879     0.998242        39411       568.89
      14.287     0.998437        39419       640.00
      14.687     0.998633        39427       731.43
      15.215     0.998828        39434       853.33
      15.695     0.999023        39442      1024.00
      16.087     0.999121        39446      1137.78
      16.183     0.999219        39450      1280.00
      16.559     0.999316        39454      1462.86
      16.671     0.999414        39457      1706.67
      17.263     0.999512        39461      2048.00
      17.455     0.999561        39463      2275.56
      17.823     0.999609        39465      2560.00
      18.111     0.999658        39467      2925.71
      18.383     0.999707        39469      3413.33
      18.783     0.999756        39472      4096.00
      18.783     0.999780        39472      4551.11
      19.615     0.999805        39473      5120.00
      19.775     0.999829        39474      5851.43
      19.871     0.999854        39475      6826.67
      20.111     0.999878        39476      8192.00
      20.111     0.999890        39476      9102.22
      21.007     0.999902        39477     10240.00
      21.007     0.999915        39477     11702.86
      21.423     0.999927        39478     13653.33
      21.423     0.999939        39478     16384.00
      21.423     0.999945        39478     18204.44
      21.599     0.999951        39479     20480.00
      21.599     0.999957        39479     23405.71
      21.599     0.999963        39479     27306.67
      21.599     0.999969        39479     32768.00
      21.599     0.999973        39479     36408.89
      23.855     0.999976        39480     40960.00
      23.855     1.000000        39480          inf
#[Mean    =        1.667, StdDeviation   =        1.497]
#[Max     =       23.840, Total count    =        39480]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59845 requests in 30.00s, 3.94MB read
  Non-2xx or 3xx responses: 59845
Requests/sec:   1994.73
Transfer/sec:    134.41KB