results/task#5/wrk_get.txt
wrk  -t4 -c200 -d30s -sget.lua -R2000 --latency http://localhost:8080
Running 30s test @ http://localhost:8080
  4 threads and 200 connections
  Thread calibration: mean lat.: 4.278ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 1.988ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.007ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.062ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.23ms    2.00ms  25.06ms   89.40%
    Req/Sec   525.39    505.66     3.57k    81.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.65ms
 75.000%    2.52ms
 90.000%    4.34ms
 99.000%   10.67ms
 99.900%   18.83ms
 99.990%   23.57ms
 99.999%   25.07ms
100.000%   25.07ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.130     0.000000            1         1.00
       0.761     0.100000         3953         1.11
       1.005     0.200000         7905         1.25
       1.227     0.300000        11854         1.43
       1.436     0.400000        15787         1.67
       1.654     0.500000        19743         2.00
       1.768     0.550000        21705         2.22
       1.898     0.600000        23688         2.50
       2.055     0.650000        25667         2.86
       2.251     0.700000        27642         3.33
       2.523     0.750000        29610         4.00
       2.719     0.775000        30584         4.44
       2.945     0.800000        31570         5.00
       3.217     0.825000        32556         5.71
       3.539     0.850000        33542         6.67
       3.901     0.875000        34529         8.00
       4.115     0.887500        35034         8.89
       4.343     0.900000        35519        10.00
       4.607     0.912500        36007        11.43
       4.915     0.925000        36503        13.33
       5.339     0.937500        36997        16.00
       5.563     0.943750        37242        17.78
       5.847     0.950000        37489        20.00
       6.175     0.956250        37735        22.86
       6.563     0.962500        37980        26.67
       7.071     0.968750        38228        32.00
       7.347     0.971875        38352        35.56
       7.671     0.975000        38475        40.00
       8.111     0.978125        38597        45.71
       8.591     0.981250        38720        53.33
       9.263     0.984375        38843        64.00
       9.615     0.985938        38907        71.11
       9.991     0.987500        38966        80.00
      10.391     0.989062        39029        91.43
      10.903     0.990625        39090       106.67
      11.431     0.992188        39151       128.00
      11.847     0.992969        39182       142.22
      12.247     0.993750        39213       160.00
      12.599     0.994531        39244       182.86
      13.399     0.995313        39276       213.33
      14.095     0.996094        39305       256.00
      14.415     0.996484        39321       284.44
      14.759     0.996875        39336       320.00
      15.255     0.997266        39352       365.71
      16.111     0.997656        39368       426.67
      16.495     0.998047        39382       512.00
      16.863     0.998242        39390       568.89
      17.215     0.998437        39398       640.00
      17.439     0.998633        39406       731.43
      18.479     0.998828        39413       853.33
      18.895     0.999023        39421      1024.00
      19.295     0.999121        39425      1137.78
      19.615     0.999219        39429      1280.00
      19.983     0.999316        39433      1462.86
      20.175     0.999414        39436      1706.67
      21.151     0.999512        39440      2048.00
      21.807     0.999561        39442      2275.56
      21.887     0.999609        39444      2560.00
      22.335     0.999658        39446      2925.71
      22.463     0.999707        39448      3413.33
      22.639     0.999756        39450      4096.00
      22.703     0.999780        39451      4551.11
      22.783     0.999805        39452      5120.00
      22.991     0.999829        39453      5851.43
      23.119     0.999854        39454      6826.67
      23.567     0.999878        39455      8192.00
      23.567     0.999890        39455      9102.22
      23.983     0.999902        39456     10240.00
      23.983     0.999915        39456     11702.86
      24.367     0.999927        39457     13653.33
      24.367     0.999939        39457     16384.00
      24.367     0.999945        39457     18204.44
      24.559     0.999951        39458     20480.00
      24.559     0.999957        39458     23405.71
      24.559     0.999963        39458     27306.67
      24.559     0.999969        39458     32768.00
      24.559     0.999973        39458     36408.89
      25.071     0.999976        39459     40960.00
      25.071     1.000000        39459          inf
#[Mean    =        2.231, StdDeviation   =        2.004]
#[Max     =       25.056, Total count    =        39459]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59383 requests in 30.00s, 3.91MB read
  Non-2xx or 3xx responses: 59383
Requests/sec:   1979.28
Transfer/sec:    133.37KB